danghoangphuong/STM32_Macro_Keyboard/keyboard/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define OLED_SCL_Pin GPIO_PIN_10
#define OLED_SCL_GPIO_Port GPIOB
#define OLED_SDA_Pin GPIO_PIN_11
#define OLED_SDA_GPIO_Port GPIOB
#define COL4_in_Pin GPIO_PIN_13
#define COL4_in_GPIO_Port GPIOB
#define COL3_in_Pin GPIO_PIN_14
#define COL3_in_GPIO_Port GPIOB
#define COL2_in_Pin GPIO_PIN_15
#define COL2_in_GPIO_Port GPIOB
#define COL1_in_Pin GPIO_PIN_8
#define COL1_in_GPIO_Port GPIOA
#define ROW1_out_Pin GPIO_PIN_15
#define ROW1_out_GPIO_Port GPIOA
#define ROW2_out_Pin GPIO_PIN_3
#define ROW2_out_GPIO_Port GPIOB
#define ROW3_out_Pin GPIO_PIN_4
#define ROW3_out_GPIO_Port GPIOB
#define ROW4_out_Pin GPIO_PIN_5
#define ROW4_out_GPIO_Port GPIOB
#define DS1307_SCL_Pin GPIO_PIN_6
#define DS1307_SCL_GPIO_Port GPIOB
#define DS1307_SDA_Pin GPIO_PIN_7
#define DS1307_SDA_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
